{"backend": "tensorflow", "class_name": "Model", "keras_version": "2.1.4", "config": {"name": "model_1", "layers": [{"name": "input_1", "inbound_nodes": [], "class_name": "InputLayer", "config": {"batch_input_shape": [null, 200, 200, 1], "dtype": "float32", "sparse": false, "name": "input_1"}}, {"name": "conv2d_1", "inbound_nodes": [[["input_1", 0, 0, {}]]], "class_name": "Conv2D", "config": {"bias_regularizer": null, "dilation_rate": [1, 1], "strides": [2, 2], "kernel_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "bias_constraint": null, "trainable": true, "activity_regularizer": null, "name": "conv2d_1", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "seed": null, "distribution": "uniform", "scale": 1.0}}, "kernel_constraint": null, "data_format": "channels_last", "activation": "linear", "filters": 32, "kernel_size": [5, 5], "padding": "same"}}, {"name": "max_pooling2d_1", "inbound_nodes": [[["conv2d_1", 0, 0, {}]]], "class_name": "MaxPooling2D", "config": {"name": "max_pooling2d_1", "strides": [2, 2], "data_format": "channels_last", "pool_size": [3, 3], "trainable": true, "padding": "valid"}}, {"name": "batch_normalization_1", "inbound_nodes": [[["max_pooling2d_1", 0, 0, {}]]], "class_name": "BatchNormalization", "config": {"moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "epsilon": 0.001, "gamma_constraint": null, "gamma_regularizer": null, "center": true, "trainable": true, "name": "batch_normalization_1", "axis": -1, "scale": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "beta_constraint": null, "beta_regularizer": null, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "momentum": 0.99}}, {"name": "activation_1", "inbound_nodes": [[["batch_normalization_1", 0, 0, {}]]], "class_name": "Activation", "config": {"name": "activation_1", "activation": "relu", "trainable": true}}, {"name": "conv2d_2", "inbound_nodes": [[["activation_1", 0, 0, {}]]], "class_name": "Conv2D", "config": {"bias_regularizer": null, "dilation_rate": [1, 1], "strides": [2, 2], "kernel_regularizer": {"class_name": "L1L2", "config": {"l1": 0.0, "l2": 9.999999747378752e-05}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "bias_constraint": null, "trainable": true, "activity_regularizer": null, "name": "conv2d_2", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_in", "seed": null, "distribution": "normal", "scale": 2.0}}, "kernel_constraint": null, "data_format": "channels_last", "activation": "linear", "filters": 32, "kernel_size": [3, 3], "padding": "same"}}, {"name": "batch_normalization_2", "inbound_nodes": [[["conv2d_2", 0, 0, {}]]], "class_name": "BatchNormalization", "config": {"moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "epsilon": 0.001, "gamma_constraint": null, "gamma_regularizer": null, "center": true, "trainable": true, "name": "batch_normalization_2", "axis": -1, "scale": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "beta_constraint": null, "beta_regularizer": null, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "momentum": 0.99}}, {"name": "activation_2", "inbound_nodes": [[["batch_normalization_2", 0, 0, {}]]], "class_name": "Activation", "config": {"name": "activation_2", "activation": "relu", "trainable": true}}, {"name": "conv2d_4", "inbound_nodes": [[["max_pooling2d_1", 0, 0, {}]]], "class_name": "Conv2D", "config": {"bias_regularizer": null, "dilation_rate": [1, 1], "strides": [2, 2], "kernel_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "bias_constraint": null, "trainable": true, "activity_regularizer": null, "name": "conv2d_4", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "seed": null, "distribution": "uniform", "scale": 1.0}}, "kernel_constraint": null, "data_format": "channels_last", "activation": "linear", "filters": 32, "kernel_size": [1, 1], "padding": "same"}}, {"name": "conv2d_3", "inbound_nodes": [[["activation_2", 0, 0, {}]]], "class_name": "Conv2D", "config": {"bias_regularizer": null, "dilation_rate": [1, 1], "strides": [1, 1], "kernel_regularizer": {"class_name": "L1L2", "config": {"l1": 0.0, "l2": 9.999999747378752e-05}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "bias_constraint": null, "trainable": true, "activity_regularizer": null, "name": "conv2d_3", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_in", "seed": null, "distribution": "normal", "scale": 2.0}}, "kernel_constraint": null, "data_format": "channels_last", "activation": "linear", "filters": 32, "kernel_size": [3, 3], "padding": "same"}}, {"name": "add_1", "inbound_nodes": [[["conv2d_4", 0, 0, {}], ["conv2d_3", 0, 0, {}]]], "class_name": "Add", "config": {"name": "add_1", "trainable": true}}, {"name": "batch_normalization_3", "inbound_nodes": [[["add_1", 0, 0, {}]]], "class_name": "BatchNormalization", "config": {"moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "epsilon": 0.001, "gamma_constraint": null, "gamma_regularizer": null, "center": true, "trainable": true, "name": "batch_normalization_3", "axis": -1, "scale": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "beta_constraint": null, "beta_regularizer": null, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "momentum": 0.99}}, {"name": "activation_3", "inbound_nodes": [[["batch_normalization_3", 0, 0, {}]]], "class_name": "Activation", "config": {"name": "activation_3", "activation": "relu", "trainable": true}}, {"name": "conv2d_5", "inbound_nodes": [[["activation_3", 0, 0, {}]]], "class_name": "Conv2D", "config": {"bias_regularizer": null, "dilation_rate": [1, 1], "strides": [2, 2], "kernel_regularizer": {"class_name": "L1L2", "config": {"l1": 0.0, "l2": 9.999999747378752e-05}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "bias_constraint": null, "trainable": true, "activity_regularizer": null, "name": "conv2d_5", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_in", "seed": null, "distribution": "normal", "scale": 2.0}}, "kernel_constraint": null, "data_format": "channels_last", "activation": "linear", "filters": 64, "kernel_size": [3, 3], "padding": "same"}}, {"name": "batch_normalization_4", "inbound_nodes": [[["conv2d_5", 0, 0, {}]]], "class_name": "BatchNormalization", "config": {"moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "epsilon": 0.001, "gamma_constraint": null, "gamma_regularizer": null, "center": true, "trainable": true, "name": "batch_normalization_4", "axis": -1, "scale": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "beta_constraint": null, "beta_regularizer": null, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "momentum": 0.99}}, {"name": "activation_4", "inbound_nodes": [[["batch_normalization_4", 0, 0, {}]]], "class_name": "Activation", "config": {"name": "activation_4", "activation": "relu", "trainable": true}}, {"name": "conv2d_7", "inbound_nodes": [[["add_1", 0, 0, {}]]], "class_name": "Conv2D", "config": {"bias_regularizer": null, "dilation_rate": [1, 1], "strides": [2, 2], "kernel_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "bias_constraint": null, "trainable": true, "activity_regularizer": null, "name": "conv2d_7", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "seed": null, "distribution": "uniform", "scale": 1.0}}, "kernel_constraint": null, "data_format": "channels_last", "activation": "linear", "filters": 64, "kernel_size": [1, 1], "padding": "same"}}, {"name": "conv2d_6", "inbound_nodes": [[["activation_4", 0, 0, {}]]], "class_name": "Conv2D", "config": {"bias_regularizer": null, "dilation_rate": [1, 1], "strides": [1, 1], "kernel_regularizer": {"class_name": "L1L2", "config": {"l1": 0.0, "l2": 9.999999747378752e-05}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "bias_constraint": null, "trainable": true, "activity_regularizer": null, "name": "conv2d_6", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_in", "seed": null, "distribution": "normal", "scale": 2.0}}, "kernel_constraint": null, "data_format": "channels_last", "activation": "linear", "filters": 64, "kernel_size": [3, 3], "padding": "same"}}, {"name": "add_2", "inbound_nodes": [[["conv2d_7", 0, 0, {}], ["conv2d_6", 0, 0, {}]]], "class_name": "Add", "config": {"name": "add_2", "trainable": true}}, {"name": "batch_normalization_5", "inbound_nodes": [[["add_2", 0, 0, {}]]], "class_name": "BatchNormalization", "config": {"moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "epsilon": 0.001, "gamma_constraint": null, "gamma_regularizer": null, "center": true, "trainable": true, "name": "batch_normalization_5", "axis": -1, "scale": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "beta_constraint": null, "beta_regularizer": null, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "momentum": 0.99}}, {"name": "activation_5", "inbound_nodes": [[["batch_normalization_5", 0, 0, {}]]], "class_name": "Activation", "config": {"name": "activation_5", "activation": "relu", "trainable": true}}, {"name": "conv2d_8", "inbound_nodes": [[["activation_5", 0, 0, {}]]], "class_name": "Conv2D", "config": {"bias_regularizer": null, "dilation_rate": [1, 1], "strides": [2, 2], "kernel_regularizer": {"class_name": "L1L2", "config": {"l1": 0.0, "l2": 9.999999747378752e-05}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "bias_constraint": null, "trainable": true, "activity_regularizer": null, "name": "conv2d_8", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_in", "seed": null, "distribution": "normal", "scale": 2.0}}, "kernel_constraint": null, "data_format": "channels_last", "activation": "linear", "filters": 128, "kernel_size": [3, 3], "padding": "same"}}, {"name": "batch_normalization_6", "inbound_nodes": [[["conv2d_8", 0, 0, {}]]], "class_name": "BatchNormalization", "config": {"moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "epsilon": 0.001, "gamma_constraint": null, "gamma_regularizer": null, "center": true, "trainable": true, "name": "batch_normalization_6", "axis": -1, "scale": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "beta_constraint": null, "beta_regularizer": null, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "momentum": 0.99}}, {"name": "activation_6", "inbound_nodes": [[["batch_normalization_6", 0, 0, {}]]], "class_name": "Activation", "config": {"name": "activation_6", "activation": "relu", "trainable": true}}, {"name": "conv2d_10", "inbound_nodes": [[["add_2", 0, 0, {}]]], "class_name": "Conv2D", "config": {"bias_regularizer": null, "dilation_rate": [1, 1], "strides": [2, 2], "kernel_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "bias_constraint": null, "trainable": true, "activity_regularizer": null, "name": "conv2d_10", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "seed": null, "distribution": "uniform", "scale": 1.0}}, "kernel_constraint": null, "data_format": "channels_last", "activation": "linear", "filters": 128, "kernel_size": [1, 1], "padding": "same"}}, {"name": "conv2d_9", "inbound_nodes": [[["activation_6", 0, 0, {}]]], "class_name": "Conv2D", "config": {"bias_regularizer": null, "dilation_rate": [1, 1], "strides": [1, 1], "kernel_regularizer": {"class_name": "L1L2", "config": {"l1": 0.0, "l2": 9.999999747378752e-05}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "bias_constraint": null, "trainable": true, "activity_regularizer": null, "name": "conv2d_9", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_in", "seed": null, "distribution": "normal", "scale": 2.0}}, "kernel_constraint": null, "data_format": "channels_last", "activation": "linear", "filters": 128, "kernel_size": [3, 3], "padding": "same"}}, {"name": "add_3", "inbound_nodes": [[["conv2d_10", 0, 0, {}], ["conv2d_9", 0, 0, {}]]], "class_name": "Add", "config": {"name": "add_3", "trainable": true}}, {"name": "flatten_1", "inbound_nodes": [[["add_3", 0, 0, {}]]], "class_name": "Flatten", "config": {"name": "flatten_1", "trainable": true}}, {"name": "activation_7", "inbound_nodes": [[["flatten_1", 0, 0, {}]]], "class_name": "Activation", "config": {"name": "activation_7", "activation": "relu", "trainable": true}}, {"name": "dropout_1", "inbound_nodes": [[["activation_7", 0, 0, {}]]], "class_name": "Dropout", "config": {"name": "dropout_1", "seed": null, "rate": 0.5, "trainable": true, "noise_shape": null}}, {"name": "dense_2", "inbound_nodes": [[["dropout_1", 0, 0, {}]]], "class_name": "Dense", "config": {"bias_regularizer": null, "kernel_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "bias_constraint": null, "trainable": true, "activity_regularizer": null, "name": "dense_2", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "seed": null, "distribution": "uniform", "scale": 1.0}}, "kernel_constraint": null, "activation": "linear", "units": 1}}, {"name": "dense_1", "inbound_nodes": [[["dropout_1", 0, 0, {}]]], "class_name": "Dense", "config": {"bias_regularizer": null, "kernel_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "bias_constraint": null, "trainable": true, "activity_regularizer": null, "name": "dense_1", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "seed": null, "distribution": "uniform", "scale": 1.0}}, "kernel_constraint": null, "activation": "linear", "units": 1}}, {"name": "activation_8", "inbound_nodes": [[["dense_2", 0, 0, {}]]], "class_name": "Activation", "config": {"name": "activation_8", "activation": "sigmoid", "trainable": true}}], "input_layers": [["input_1", 0, 0]], "output_layers": [["dense_1", 0, 0], ["activation_8", 0, 0]]}}